# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [0]:
import pandas as pd
import numpy as np

In [0]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [4]:
black_friday

        User_ID Product_ID  ... Product_Category_3 Purchase
0       1000001  P00069042  ...                NaN     8370
1       1000001  P00248942  ...               14.0    15200
2       1000001  P00087842  ...                NaN     1422
3       1000001  P00085442  ...                NaN     1057
4       1000002  P00285442  ...                NaN     7969
...         ...        ...  ...                ...      ...
537572  1004737  P00193542  ...                NaN    11664
537573  1004737  P00111142  ...               16.0    19196
537574  1004737  P00345942  ...                NaN     8043
537575  1004737  P00285842  ...                NaN     7172
537576  1004737  P00118242  ...                NaN     6875

[537577 rows x 12 columns]

In [5]:
print(f'O dataset Black Friday possui {black_friday.shape[0]} linhas e {black_friday.shape[1]} colunas.')

O dataset Black Friday possui 537577 linhas e 12 colunas.

In [6]:
black_friday.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [7]:
black_friday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [8]:
black_friday.describe()

            User_ID    Occupation  ...  Product_Category_3       Purchase
count  5.375770e+05  537577.00000  ...       164278.000000  537577.000000
mean   1.002992e+06       8.08271  ...           12.669840    9333.859853
std    1.714393e+03       6.52412  ...            4.124341    4981.022133
min    1.000001e+06       0.00000  ...            3.000000     185.000000
25%    1.001495e+06       2.00000  ...            9.000000    5866.000000
50%    1.003031e+06       7.00000  ...           14.000000    8062.000000
75%    1.004417e+06      14.00000  ...           16.000000   12073.000000
max    1.006040e+06      20.00000  ...           18.000000   23961.000000

[8 rows x 7 columns]

In [9]:
black_friday.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [10]:
black_friday.pivot_table(black_friday, index = ['Marital_Status'], aggfunc = ['mean'])

                     mean                     ...
               Occupation Product_Category_1  ...     Purchase       User_ID
Marital_Status                                ...
0                7.948760           5.231467  ...  9333.325467  1.002965e+06
1                8.276429           5.388219  ...  9334.632681  1.003030e+06

[2 rows x 6 columns]

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [0]:
def q1():
    # Retorne aqui o resultado da questão 1.
    shape = black_friday.shape
    return shape

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [0]:
def q2():
    # Retorne aqui o resultado da questão 2.
    women = black_friday['Gender'] == 'F'
    age_between_26_35 = black_friday['Age'] == '26-35'
    result = black_friday[women & age_between_26_35]['User_ID'].count()
    return int(result)

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [0]:
def q3():
    # Retorne aqui o resultado da questão 3.
    unique_counts = black_friday['User_ID'].nunique()
    return unique_counts

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [0]:
def q4():
    # Retorne aqui o resultado da questão 4.
    types_count = black_friday.dtypes.nunique()
    return types_count

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [0]:
def q5():
    # Retorne aqui o resultado da questão 5.
    total_values = black_friday.shape[0]
    without_nan_values = black_friday.dropna().shape[0]
    result = (total_values - without_nan_values) / total_values
    return result

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [0]:
def q6():
    # Retorne aqui o resultado da questão 6.
    max_null_value = black_friday.isnull().sum().max()
    return int(max_null_value)

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [0]:
def q7():
    # Retorne aqui o resultado da questão 7.
    prod_cat_3 = black_friday['Product_Category_3'].dropna()
    mode_freq = prod_cat_3.mode()
    return float(mode_freq)

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [0]:
def q8():
    # Retorne aqui o resultado da questão 8.
    purchase = black_friday['Purchase']
    purchase_min = purchase.min()
    purchase_max = purchase.max()
    purchase_normalization = ( purchase - purchase_min ) / (purchase_max - purchase_min) 
    purchase_normalization_mean = purchase_normalization.mean()
    return float(purchase_normalization_mean)

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [0]:
def q9():
    # Retorne aqui o resultado da questão 9.
    purchase = black_friday['Purchase']
    purchase_mean = purchase.mean()
    purchase_std = purchase.std()
    purchase_standardization = (purchase - purchase_mean) / purchase_std
    result = ((purchase_standardization <= 1) & (purchase_standardization >= -1)).sum()
    return int(result)

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [0]:
def q10():
    po_cat_2_null = black_friday['Product_Category_2'].isnull()
    po_cat_3_null = black_friday['Product_Category_3'].isnull()
    compare = po_cat_2_null == po_cat_3_null 
    return (True in compare)